periodic = "1 H Водород (а.м. 1,00794) " \
           " 2 He Гелий (а.м. 4,002602) " \
           " 3 Li Литий (а.м. 6,9412) " \
           " 4 Be Бериллий (а.м. 9,0122) " \
           "5 B Бор (а.м. 10,812)" \
           "6 C Углерод (а.м. 12,011)" \
           "7 N Азот (а.м. 14,0067)" \
           "8 O Кислород (а.м. 15,9994)" \
           "9 F Фтор (а.м. 18,9984)" \
           "10 Ne Неон (а.м. 20,179)" \
           "11 Na Натрий (а.м. 22,98977)" \
           "12 Mg Магний (а.м. 24,305)" \
           "13 Al Алюминий (а.м. 26,98154)" \
           "14 Si Кремний (а.м. 28,086)" \
           "15 P Фосфор (а.м. 30,97376)" \
           "16 S Сера (а.м. 32,06)" \
           "17 Cl Хлор (а.м. 35,453)" \
           "18 Ar Аргон (а.м. 39,948)" \
           "19 K Калий (а.м. 39,0983)" \
           "20 Ca Кальций (а.м. 40,08)" \
           "21 Sc Скандий (а.м. 44,9559)" \
           "22 Ti Титан (а.м. 47,9)" \
           "23 V Ванадий (а.м. 50,9415)" \
           "24 Cr Хром (а.м. 51,996)" \
           "25 Mn Марганец (а.м. 54,938)" \
           "26 Fe Железо (а.м. 55,847)" \
           "27 Co Кобальт (а.м. 58,9332)" \
           "28 Ni Никель (а.м. 58,7)" \
           "29 Cu Медь (а.м. 63,546)" \
           "30 Zn Цинк (а.м. 65,38)" \
           "31 Ga Галлий (а.м. 69,72)" \
           "32 Ge Германий (а.м. 72,59)" \
           "33 As Мышьяк (а.м. 74,9216)" \
           "34 Se Селен (а.м. 78,96)" \
           "35 Br Бром (а.м. 79,904)" \
           "36 Kr Криптон (а.м. 83,8)" \
           "37 Rb Рубидий (а.м. 85,4678)" \
           "38 Sr Стронций (а.м. 87,62)" \
           "39 Y Иттрий (а.м. 88,9059)" \
           "40 Zr Цирконий (а.м. 91,20)" \
           "41 Nb Ниобий (а.м. 92,9064)" \
           "42 Mo Молибден (а.м. 95,94)" \
           "43 Tc Технеций (а.м. 98,9062)" \
           "44 Ru Рутений (а.м. 101,07)" \
           "45 Rh Родий (а.м. 102,9055)" \
           "46 Pd Палладий (а.м. 106,4)" \
           "47 Ag Серебро (а.м. 107,868)" \
           "48 Cd Кадмий (а.м. 112,41)" \
           "49 In Индий (а.м. 114,82)" \
           "50 Sn Олово (а.м. 118,69)" \
           "51 Sb Сурьма (а.м. 121,75)" \
           "52 Те Теллур (а.м. 127,6)" \
           "53 I Йод (а.м. 126,9045)" \
           "54 Xe Ксенон (а.м. 131,3)" \
           "55 Cs Цезий (а.м. 132,9054)" \
           "56 Ba Барий (а.м. 137,33)" \
           "57 La Лантан (а.м. 138,9)" \
           "58 Ce Церий (а.м. 140,12)" \
           "59 Pr Празеодим (а.м. 140,9)" \
           "60 Nd Неодим (а.м. 144,24)" \
           "61 Pm Прометий (а.м. 145)" \
           "62 Sm Самарий (а.м. 150,35)" \
           "63 Eu Европий (а.м. 151,96)" \
           "64 Gd Гадолиний (а.м. 157,25)" \
           "65 Tb Тербий (а.м. 158,92)" \
           "66 Dy Диспрозий (а.м. 162,5)" \
           "67 Ho Гольмий (а.м. 164,93)" \
           "68 Er Эрбий (а.м. 167,26)" \
           "69 Tm Тулий (а.м. 168,93)" \
           "70 Yb Иттербий (а.м. 173,04)" \
           "71 Lu Лютеций (а.м. 174,97)" \
           "72 Hf Гафний (а.м. 178,49)" \
           "73 Ta Тантал (а.м. 180,9479)" \
           "74 W Вольфрам (а.м. 183,85)" \
           "75 Re Рений (а.м. 186,207)" \
           "76 Os Осмий (а.м. 190,2)" \
           "77 Ir Иридий (а.м. 192,22)" \
           "78 Pt Платина (а.м. 195,09)" \
           "79 Au Золото (а.м. 196,9665)" \
           "80 Hg Ртуть (а.м. 200,59)" \
           "81 Tl Таллий (а.м. 204,37)" \
           "82 Pb Свинец (а.м. 207,2)" \
           "83 Bi Висмут (а.м. 208,9)" \
           "84 Po Полоний (а.м. 209)" \
           "85 At Астат (а.м. 210)" \
           "86 Rn Радон (а.м. 222)" \
           "87 Fr Франций (а.м. 223)" \
           "88 Ra Радий (а.м. 226)" \
           "89 Ac Актиний (а.м. 227)" \
           "90 Th Торий (а.м. 232,03)" \
           "91 Pa Протактиний (а.м. 231,03)" \
           "92 U Уран (а.м. 238,02)" \
           "93 Np Нептуний (а.м. 237,04)" \
           "94 Pu Плутоний (а.м. 244,06)" \
           "95 Am Америций (а.м. 243,06)" \
           "96 Cm Кюрий (а.м. 247,07)" \
           "97 Bk Берклий (а.м. 247,07)" \
           "98 Cf Калифорний (а.м. 251,07)" \
           "99 Es Эйнштейний (а.м. 252,08)" \
           "100 Fm Фермий (а.м. 257,08)" \
           "101 Md Менделевий (а.м. 258,09)" \
           "102 No Нобелий (а.м. 259,1)" \
           "103 Lr Лоуренсий (а.м. 260,1)" \
           "104 Rf Резерфордий (а.м. 261)" \
           "105 Db Дубний (а.м. 262)" \
           "106 Sg Сиборгий (а.м. 266)" \
           "107 Bh Борий (а.м. 267)" \
           "108 Hs Хассий (а.м. 269)" \
           "109 Mt Мейтнерий (а.м. 276)" \
           "110 Ds Дармштадтий (а.м. 227)" \
           "111 Rg Ренгений (а.м. 280)" \
           "112 Cn Коперниций (а.м. 285)"
per = ""
for i in range(len(periodic)):
    per += periodic[i]
    if periodic[i] == ')':
        per += ' '

per = per.split()
table = {}
for i in range(len(per) - 1):
    try:
        table[int(per[i])] = per[i + 1]
    except ValueError:
        pass


def get_periodic_table():

    return table
